print('绝对值：', abs(100), abs(-100), abs(0))
print('商和余数', divmod(13, 4))
print('最大值：', max([10, 23, 54, 78, 90]))
print('最小值：', min([10, 23, 54, 78, 90]))
print('最小值：', min('hello'))

print('求和：', sum([10, 23, 54, 78, 90]))
print('x的y次幂：', pow(2, 3))

# 四舍五入
print(round(3.141592653589793)) # round函数只有一个参数，保留整数
print(round(3.941592653589793))
# 保留两位小数
print(round(3.141592653589793, 2))
print(round(3.141592653589793, 0)) # 保留整数
print(round(3.141592653589793, -1)) # 保留负一位 , 对个位进行四舍五入
print(round(314.1592653589793, -1)) # 保留负一位
print(round(314.1592653589793, -2)) # 保留负一位 , 对十位进行四舍五入
